---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewDisplayBackgroundImageFlags.FixedAspectRatio
enum: Autodesk.Revit.DB.ViewDisplayBackgroundImageFlags
source: html/71eaa252-5e4c-ee0b-0096-fc06fddeff11.htm
---
# Autodesk.Revit.DB.ViewDisplayBackgroundImageFlags.FixedAspectRatio

The image is stretched but the ratio of its height to width is preserved.